/* one second or more (formatting of milliseconds) */
"%#.3g seconds" = "%#.3g seconds";

/* format for milliseconds */
"%ld milliseconds" = "%ld milliseconds";

/* importing sysex: x of y */
"%u of %u" = "%1$u of %2$u";

/* string for one second exactly */
"1 second" = "1 second";

/* display name of virtual source */
"Act as a source for other programs" = "Act as a source for other programs";

/* Cancel button in alert */
"Cancel" = "Cancel";

/* Cancelled. */
"Cancelled." = "Cancelled.";

/* title of alert when can't read a sysex file */
"Could not read SysEx" = "Could not read SysEx";

/* title of destination toolbar item */
"Destination" = "Destination";

/* Done. */
"Done." = "Done.";

/* title of error alert */
"Error" = "Error";

/* title of alert for file already in library */
"In Use" = "In Use";

/* title of alert for missing file */
"Missing File" = "Missing File";

/* format of message when no sysex data found in files */
"No SysEx data could be found in %u of the files. They have not been added to the library." = "No SysEx data could be found in %u of the files. They have not been added to the library.";

/* message when no sysex data found in file */
"No SysEx data could be found in this file. It has not been added to the library." = "No SysEx data could be found in this file. It has not been added to the library.";

/* none */
"None" = "None";

/* title of quit button */
"Quit" = "Quit";

/* message when receiving sysex */
"Receiving SysEx message…" = "Receiving SysEx message…";

/* Scanning... */
"Scanning..." = "Scanning...";

/* format for progress message when sending multiple sysex messages */
"Sending message %u of %u…" = "Sending message %1$u of %2$u…";

/* format for progress message when sending multiple sysex messages */
"Sending message…" = "Sending message…";

/* default file name for exported standard MIDI file (w/o extension) */
"SysEx" = "SysEx";

/* message of alert when can't send feedback email */
"SysEx Librarian could not ask your email application to create a new message.\nPlease send email to:\n%@" = "SysEx Librarian could not ask your email application to create a new message.\nPlease send email to:\n%@";

/* subject of feedback email */
"SysEx Librarian Feedback" = "SysEx Librarian Feedback";

/* message for file already in library */
"That file is already in the library. Please choose another one." = "That file is already in the library. Please choose another one.";

/* message of alert when recording to a new file fails */
"The file could not be created." = "The file could not be created.";

/* message if sysex can't be exported */
"The file could not be saved." = "The file could not be saved.";

/* format of message for missing file */
"The file for the item \"%@\" could not be found. Would you like to locate it?" = "The file for the item \"%@\" could not be found. Would you like to locate it?";

/* message of alert when renaming a file fails */
"The file for this item could not be renamed." = "The file for this item could not be renamed.";

/* error message if help file can't be found */
"The help file could not be found." = "The help file could not be found.";

/* error message if opening the help file fails */
"The help file could not be opened." = "The help file could not be opened.";

/* format of error message if the library file can't be saved */
"The library \"%@\" could not be saved." = "The library \"%@\" could not be saved.";

/* format of error message if the library file can't be read */
"The library file \"%@\" could not be read." = "The library file \"%@\" could not be read.";

/* error message if the path to the library file can't be created */
"The path to the library file \"~/Preferences/SysEx Librarian Library.sXLb\" could not be created." = "The path to the library file \"~/Preferences/SysEx Librarian Library.sXLb\" could not be created.";

/* error message on preflight library */
"There is a problem accessing the SysEx Librarian preferences." = "There is a problem accessing the SysEx Librarian preferences.";

/* error message if MIDI initialization fails */
"There was a problem initializing the MIDI system. To try to fix this, log out and log back in, or restart the computer." = "There was a problem initializing the MIDI system. To try to fix this, log out and log back in, or restart the computer.";

/* format of progress message when receiving multiple sysex messages (one message so far) */
"Total: %d message, %@" = "Total: %1$d message, %2$@";

/* format of progress message when receiving multiple sysex messages (more than one message so far) */
"Total: %d messages, %@" = "Total: %1$d messages, %2$@";

/* name of missing endpoint if not specified in document
   Unknown */
"Unknown" = "Unknown";

/* name of new sysex file */
"Untitled" = "Untitled";

/* Various */
"Various" = "Various";

/* message when waiting for sysex */
"Waiting for SysEx message…" = "Waiting for SysEx message…";

/* Yes button in alert */
"Yes" = "Yes";

